---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveConstrained
source: html/11301138-6732-6b0e-3ba6-8a222f51a51a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveConstrained Property

"Constrained"

## Syntax (C#)
```csharp
public static ForgeTypeId PointAdaptiveConstrained { get; }
```